package com.eunsue.luck.tarot;

public class cardBase {
    private String[] card = new String[44];

    public cardBase(){
        card[0] = "소년이 여행을 떠난다는 점에서 시작을 의미하기도 하고 소년이 손에 들고있는 백장미는 순수함, 빈보따리는 가진것이 없음 ,위태로운 절벽위에서 한가로이 서있는 소년의 모습에서 위기를 모르는 상태 등을 상징한다.새로운 시작은 다른 어떤것을 끝낼때 일어나는 것으로 끝을 상징하기도 한다";
        card[1] = "펜타클,컵,칼,나무막대기는 각각 ,흙,물,바람,불 을 상징하는 요소로써 세상을 구성하는 4원소 모두가 마술사 앞에 놓여있다는것은 마술사가 4원소를 모두 다룰줄 알고 그만큼 다재다능하다는 것을 의미한다. 하지만 모든 원소를 다룰수 있는만큼 특출날 하나가 없을수 있다. 마술사의 허리를 감고있는 뱀과 머리위의 모양은 무한대의 에너지를 상징한다. 옆의 카드는 THE MAGICIAN 카드의 다른 한면을 보여주는 카드인데 사람들을 선동하는 약장수의 느낌이나며 신뢰할수없는 사기꾼, 또는 바람둥이를 상징하기도 한다.";
        card[2] = "수녀는 자기감정을 잘 드러내지는 않지만 생각이 깊다. 이카드는 비밀,신념 지조,절개 등을 상징하기도 하나 하얀색과 검은색의 기둥은 흑백논리,고집을 상징하기도 한다.";
        card[3] = "여황제는 귀하게 자라 어려움을 모른다. 항상 사랑받고 자랐기 때문에 이기적일수 있지만 받은사랑을 돌려주는 따듯한 면모를 보이기도 한다.사치와 화려함을 좋아한다. 여황제는 어머니를 의미하기도하는데 이는 모성애를 상징한다. 모성애는 엄마의 사랑처럼 마음에 드는사람에게만 주는 사랑을 의미한다.";
        card[4] = "황제는 여황제와는 달리 자신의 입지를 다지기 위해 불모지를 개척하고 돌의자를 직접깍아 황제가 된 자수성가형이다. 갖은 고생을 하며 성장했기때문에 소신과 신념이 강하고 고집이 강하며 자존심이 세다. 한번 사람을 밀어주기 시작하면 끝까지 책임을 지고 돌아서면 냉정히 끝이다.";
        card[5] = "교황은 상대방을 이해하고 포용하며 정신적 조력자가 된다. 교황은 공기업이나 정부기관같은 안정적이며 큰 조직을 뜻하기도 한다.남녀관계에 있어서는 결혼을 뜻하기도 한다.";
        card[6] = "THE LOVER 카드에서의 사랑은 불같은사랑 보다는 신뢰와 존중을 바탕으로 하는 사랑으로 남녀간이 아니더라도 좋은 인간관계를 상징하기도 한다. THE LOVER 카드는 이성보다는 감성의 카드이기 때문에 비지니스나 학업에서는 구체성이 떨어지고 불확실함을 상징할수 있다.";
        card[7] = "전차를 타고 가는 남자. 물불 안가리고 뛰어들것 같은 이미지를 연상시킨다.목표의식이 생기면 불같이 뛰어드는 성향은 불의 성질이라고 한다. 이런사람은 추진력은 좋으나 주위를 살피지 못하고 시야가 좁고 끈기나 인내심이 부족하다. 또한 추진과정에서 주위사람을 잃을수 있다.";
        card[8] = "여자가 사자를 애완강아지 다루듯 부드럽게 다루고있다. 이는 여자의 겉으로 보이지 않는 강한 내공에 의해 가능한것이며 강한 내공은 오랜기간의 인내와 노력에의해 생긴다. 여자에 복종하는 사자의 모습에서 큰문제는 없지만 불편한 관계를 의미하기도 한다. 장기연애의 상황에서 이카드가 나온다면 한사람의 내공으로 다른사람이 잘 따르고있는것으로 긍정적이다.";
        card[9] = "은둔자 카드는 수염을 기르고 지팡이를 들고다는게 도인처럼 보인다. 산속에서 혼자 도를 닦아 소신과 가치관이 강하고 관심있는 분야만 보고있기 때문에 시야가 좁다. 자신만의 코드와 가치관이 있기때문에 다른사람과 맞추기 힘들고 혼자가 편하다.";
        card[10] = "타로카드에서 의 운은 지상의운과 하늘의 운 두가지로 구분할수  있는데 운명의 수레바퀴카드는 지상의 운 카드이다. 지상의 운은 주변환경과 사람의 영향력을 의미한다. 사람과 환경은 한번 인연을 맺게되면 쉽게 빠져나오기가 힘들다. 지상의 운이기때문에 강한의지가 있다면 어느정도 컨트롤과 예측이 가능하다.";
        card[11] = "왕으로 보이는 사람이 한손에는 칼을 다른 한손에는 저울을 들고있다. 저울은 공정함, 칼은 냉정하고 이성적인 판단을 의미한다.이 카드는 법적인 이슈를 상징하고 남녀관계에서는 결혼이나 이혼을 의미할수 있다. 사업에서는 냉정하게 정리할 기회나 위기를 의미할 수있다. 이 카드는 감성과 순수함보다는 이성과 세속적이다.";
        card[12] = "매달린 사람은 흉악범죄를 저질러 처벌을 받는것이 아닌 자신의 강한 신념이나 가치관을 지키는 행동을 하다 처형을 당하고 있다. 처형을 당해도 소신을 굽히지 않을만큼 융통성이 없지만 책임감과 끈기가 있다. 자신이 믿는것이 강해 시야가 좁고 사람들과 어울리기 어렵다.";
        card[13] = "죽음의 사신 앞에서 교황,황제,,여왕,왕자가 쓰러져 있거나 자비를 구하고 있다. 죽음이란 지휘고하를 막론하고 피할수가 없다. 즉 이 카드는 필연을 상징한다. 모든 시작은 끝과 함께온다. 죽음의 사신 너머 떠오르는 태양은 새로운 시작을 의미하기도 한다. 지금의 상황이 부정적이라면 DEATH 카드는 부정적 상황을 끝낼수 있음을 의미할수 있다.";
        card[14] = "천사는 물과 땅에 발을 동시에 두고 있다. 물은 감성을 땅은 이성을 상징한다.이는 이성과 감성을 사이에두고 하는 고민을 의미한다. 또 천사의 손을 보면 한쪽 컵에서 다른쪽 컵으로 물을 이동시키고 있다. 신중하게 물을 이컵에서 저컵으로 조절하고 있다. 신중한 만큼 추진력은 떨어지고 물의 이동은 이직이나 이동을 의미하기도 한다.";
        card[15] = "악마의 구속을 받으며 남녀가 쇠사슬에 묶여있다. 잘보면 두 남녀가 천사의 축복을 받고있는 THE LOVER 카드와 구도가 비슷하다. 타로카드의 운을 상징하는  메이저 카드중 하늘의 운을 상징한다. THE DEVIL카드는 중독,집착,남용,질투 등을 의미하고 연애에 있어서는 불같은 사랑이나 불륜을 뜻하기도 한다. 사업에있어서는 잠깐 돈을 버는 한철사업을 의미하기도 한다.";
        card[16] = "THE TOWER 카드는 하늘의 운을 상징하는 카드이다. 탑에서 지내던 두 사람이 하늘에서 떨어진 번개에 의해 내동댕이 쳐진다.나의 의지나 환경외의 변수에 의해 일어난 일이다. 외부개입을 의미하는 경우가 많은 THE TOWER 카드는 연인관계에서는 다른 이성의 등장이나 부모님의 반대등을 뜻할때가 많다. 직장이나 사업에서는 전혀 예상치 못한 변화를 암시한다. 하늘의 운은 막을수도 없고 피할수도 없다.";
        card[17] = "벗은 여인앞의 운덩이에는 물이 넘치고 있다.벗은 여인은 성적인 매력을 나타내기도 하고 순수한 행복이나 사랑을 의미하기도 한다. 반짝이는 별은 보기에는 아름다워 보읻지만 언제 없어질지 모르는 불안한 요소를 가지고 있다. 인간관계에서는 좋은 카드이나 학업이나 비지니스에서는 불안한 카드이다.";
        card[18] = "THE MOON 카드는 해가뜨기전에 달빛에 의존해 아침을 기다림을 나타내는 카드이다. 어두운 밤에 달빛 하나에 의존하고 있어 막막하고 불안하다. 달을 바라보고있는 늑대는 숨겨진 본능이나 욕망을, 물에서 올라온 가재는 단단한 껍질을 가지고있지만 부드러운 속살을 가지고 있어 감춰진 이면을 의미한다.";
        card[19] = "어둠을 뚫고 드디어 태양이 떠올랐다. 새싹이 돋아나고 행복이 다가오는 봄을 의미한다.카드 중앙의 어린아이는 백마를 타고 해맑게 웃고있지만 어딘가 불안하다. ";
        card[20] = "심판카드는 타워카드와 더불어 하늘의 운을 상징하는 카드이다. 요한계시록 심판의 날에서는 산자와 죽은자를 나누기 위해나팔을 분다. 산자와 죽은자의 명확한 구분, 이는 분명한 결론이 날 것임을 암시한다.심판의 날엔 그저 받아들이는 것 외에는 아무것도 할수 있는 일이 없다.심판카드가 부정적 카드일지 긍정적 카드일지는 심판카드 이후의 카드를 보고 판단할수 있다.";
        card[21] = "첫번째 카드 THE FOOL 카드에서 시작한 여정이 드디어 THE WORLD 카드를 통해 끝이 난다. 종착지 카드로 더이상 나아갈 곳도 물러설 일도 없다. 종착지를 의미하기 떄문에 더이상의 발전을 기대하기는 힘들다. 하지만 끝은 언제나 새로운 시작을 의미하기도한다. 오랫동안 끌어왔던 일을 마무리하기를 조언하는 카드이기도 하다.";
    }

    public String getCard(int index){
        return card[index];
    }
}
